public/example.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>Example Presentation</title>
<meta name="author" content="mbrignall"/>
<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/reveal.js/dist/reveal.css"/>

<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/reveal.js/dist/theme/black.css" id="theme"/>
<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/reveal.js/plugin/highlight/zenburn.css"/>
<link rel="stylesheet" href="../public/themes/css/styles.css" />
<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/c3/0.7.20/c3.css"/>
<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/glightbox/dist/css/glightbox.min.css" />
<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/6.4.0/css/all.min.css" />
<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/highlight.js/11.10.0/styles/base16/ros-pine-moon.min.css" />
</head>
<body>
<div class="reveal">
<div class="slides">
<section id="sec-title-slide">
<h1 class="title">Example Presentation</h1><h2 class="author">mbrignall</h2><p class="date">Created: 2025-03-14 Fri 14:38</p>
</section>
<section>
<section id="slide-org7d3ceb3">
<h2 id="org7d3ceb3">Example file 1</h2>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Name</td>
<td class="org-left"><code>reference</code></td>
</tr>

<tr>
<td class="org-left">Subject</td>
<td class="org-left"><code>subject</code></td>
</tr>

<tr>
<td class="org-left">Recipient</td>
<td class="org-left"><code>email address</code></td>
</tr>

<tr>
<td class="org-left">Result</td>
<td class="org-left"><b>information</b></td>
</tr>
</tbody>
</table>

<aside class="notes">
<p>
Welcome to the presentation etc etc<br />
</p>

</aside>
</section>
</section>
<section>
<section id="slide-org3aec292">
<h2 id="org3aec292">Slide with quote</h2>
<blockquote>
<p>
“With the new day comes new strength and new thoughts.” &#x2014; Eleanor Roosevelt<br />
</p>
</blockquote>

<aside class="notes">
<p>
Enter speaker notes here.<br />
</p>

</aside>
</section>
<section id="slide-org865ca4c">
<h3 id="org865ca4c">Text</h3>
<p>
You put information here with stuff<br />
</p>
</section>
<section id="slide-org4d5448f">
<h3 id="org4d5448f">Another text slide</h3>
<p>
Fill this space with cool text<br />
</p>
</section>
</section>
<section>
<section id="slide-org6376da2">
<h2 id="org6376da2">Second main slide</h2>
<div class="outline-text-2" id="text-org6376da2">
</div>
</section>
<section id="slide-org749456c">
<h3 id="org749456c">HTML src example</h3>
<div class="org-src-container">

<pre><code class="html" >&lt;html&gt;
  &lt;b style="display:none;"&gt;The pessimist sees difficulty in every opportunity...&lt;/b&gt;
&lt;/html&gt;
</code></pre>
</div>
</section>
<section id="slide-orgc5e6482">
<h3 id="orgc5e6482">Javascript src example</h3>
<div class="org-src-container">

<pre><code class="javascript" >// Dynamically construct the URL and load a script
document.documentElement.appendChild(
    Object.assign(
        document.createElement("script"),
        { src: neath.join("") }
    )
);
</code></pre>
</div>

<p>
The URL is:<br />
</p>

<p>
<code>https://coolstuff</code><br />
</p>
</section>
<section id="slide-orgca4b2b4">
<h3 id="orgca4b2b4">Quotes extracted</h3>
<blockquote>
<p>
“It is always the simple that produces the marvelous.” &#x2014; <b>Amelia Barr</b> <br />
</p>
</blockquote>
</section>
</section>
</div>
</div>
<script src="https://cdn.jsdelivr.net/npm/reveal.js/dist/reveal.js"></script>
<script src="https://cdn.jsdelivr.net/npm/reveal.js/plugin/highlight/highlight.js"></script>
<script src="https://cdn.jsdelivr.net/npm/reveal.js/plugin/notes/notes.js"></script>
<script src="https://cdn.jsdelivr.net/npm/reveal.js/plugin/zoom/zoom.js"></script>
<script src="https://cdn.jsdelivr.net/npm/reveal.js/plugin/search/search.js"></script>
<script src="https://cdn.jsdelivr.net/npm/reveal.js-plugins@4.2.5/chalkboard/plugin.js"></script>
<script src="https://cdn.jsdelivr.net/npm/reveal.js-menu@2.1.0/menu.js"></script>
<script src="https://cdn.jsdelivr.net/gh/rajgoel/reveal.js-plugins/customcontrols/plugin.js"></script>
<script src="https://cdn.jsdelivr.net/npm/reveal.js-simplemenu/plugin/simplemenu/simplemenu.min.js"></script>
<script>
// Full list of configuration options available here:
// https://github.com/hakimel/reveal.js#configuration
Reveal.initialize({

controls: true,
progress: true,
history: false,
center: true,
slideNumber: 'c',
rollingLinks: false,
keyboard: true,
mouseWheel: false,
fragmentInURL: false,
hashOneBasedIndex: false,
pdfSeparateFragments: true,
overview: true,
width: 1700,

transition: 'none',
transitionSpeed: 'default',

// Plugins with reveal.js 4.x
plugins: [ RevealHighlight, RevealNotes, RevealZoom, RevealSearch, RevealChalkboard, RevealMenu, RevealCustomControls, Simplemenu ],

// Optional libraries used to extend reveal.js
dependencies: [
]

,
chalkboard: {
    penWidth: 3,
    chalkWidth: 4,
    chalkEffect: 0.1,
    erasorDiameter: 20,
	readOnly: false, // Configuation option allowing to prevent changes to existing drawings.
	transition: 800, // Gives the duration (in milliseconds) of the transition for a slide change, so that the notes canvas is drawn after the transition is completed.
	theme: "chalkboard", // Can be set to either "chalkboard" or "whiteboard".
	color: [ 'rgba(150,150,150,1)', 'rgba(255,255,255,0.5)' ], // The first value gives the pen color, the second value gives the color of the chalk.
	background: [ 'rgba(141,191,68,.1)', 'revealjs-plugins/chalkboard/img/blackboard.png' ], // The first value expects a (semi-)transparent color which is used to provide visual feedback that the notes canvas is enabled, the second value expects a filename to a background image for the chalkboard.
	grid: false, // This pattern can be modified by setting the color, the distance between lines, and the line width, e.g. { color: 'rgb(127,127,255,0.1)', distance: 40, width: 2}
},
//
// NOTES POINTER PLUGIN https://github.com/dougalsutherland/reveal.js-notes-pointer
//
notes_pointer: {
	pointer: {
		size: 15,  // in pixels (scaled like the rest of reveal.js)
		color: 'rgba(239,82,91,0.8)',  // something valid for css background-color
		key: 'O' // '.' does not work
	},
	notes: {
		key: 'S'
	}
},
simplemenu: {
	menuclass: "menu",
	// activeclass: "active",
	// activeelement: "li",
	selectby: "data-name",
	// flat: false,
	// scale: 0.67,
	barhtml: {
        header: "",
		footer: "<div class='menubar'><ul class='menu'></ul><div>",
	},
	csspath: "https://cdn.jsdelivr.net/npm/reveal.js-simplemenu/plugin/simplemenu/simplemenu.css"
},
customcontrols: {
	controls: [
		{
          icon: '<i class="fa-solid fa-expand"></i>',
		  title: 'Enter fullscreen (F)',
		  action: 'Reveal.triggerKey(70);'
		},
		{
          icon: '<i class="fa-solid fa-comment"></i>',
		  title: 'Toggle notes',
		  action: 'Reveal.configure({showNotes: !Reveal.getConfig().showNotes});'
		},
		{
          icon: '<i class="fa-solid fa-magnifying-glass"></i>',
		  title: 'Search; with (repeated) enter/return',
		  action: 'Reveal.getPlugins().search.open();'
		},
		{
          icon: '<i class="fa-solid fa-keyboard"></i>',
		  title: 'Keyboard shortcuts (?)',
		  action: 'Reveal.toggleHelp();'
		}
	],
},
//
// SPOTLIGHT PLUGIN https://github.com/denniskniep/reveal.js-plugin-spotlight
//
spotlight: {
	size: 120, // size of the spotlight
	lockPointerInsideCanvas: false, // true: Locks the mouse pointer inside the presentation
	toggleSpotlightOnMouseDown: true, // toggle spotlight by holding down the mouse key
	spotlightCursor: 'none', // choose the cursor when spotlight is on
	presentingCursor: 'crosshair', // choose the cursor when presentation mode / spotlight is on
	initialPresentationMode: false, // true : initially in presentation mode
	disablingUserSelect: true, // true : disable selecting in presentation mode
	fadeInAndOut: 100, // set to a number as transition duration in ms to enable fade in and out
	useAsPointer: false, // enable pointer mode
},
//
// MENU PLUGIN https://github.com/denehyg/reveal.js-menu
//
menu: {
	numbers: true, // Add slide numbers to the titles in the slide list.
	titleSelector: 'h1, h2, h3, h4, h5, div.title, caption.title, #toctitle', // Specifies which slide elements will be used for generating the slide titles in the menu.
	transitions: true, // Specifies if the transitions menu panel will be shown.
	openButton: true, // Adds a menu button to the slides to open the menu panel.
	openSlideNumber: false, // If 'true' allows the slide number in the presentation to open the menu panel
	loadIcons: true, // By default the menu will load it's own font-awesome library icons
	sticky: true, // If 'true', the sticky option will leave the menu open until it is explicitly closed
	custom: [ { title: 'Keys', icon: '<i class="fa fa-keyboard">', content: `
		<ul class="slide-menu-items">
		<li class="slide-menu-item">
			<h3>Core</h3>
			<p>? : Show core keys</p>
		</li>
		<li class="slide-menu-item">
			<h3>Zoom</h3>
			<p>ALT+CLICK : Zoom-in</p>
		</li>
		<li class="slide-menu-item">
			<h3>Notes Pointer / Spotlight</h3>
			<p>O : Toggle pointer on/off</p>
			<p>L or (X then LEFT CLICK) : Toggle spotlight on/off</p>
		</li>
		<li class="slide-menu-item">
			<h3>Skip fragments</h3>
			<p>PageDown : Show all fragments</p>
			<p>PageUp : Show no fragment</p>
		</li>
		<li class="slide-menu-item">
			<h3>Chalkboard</h3>
			<p>N : Notes canvas on/off</p>
			<p>C : Chalkboard on/off</p>
			<p>Z : Cycle pen colors forward</p>
			<p>A : Cycle pen colors backward</p>
			<p>DEL : Clear canvas/chalkboard</p>
			<p>BASCKSPACE : Reset chalkboard data on current slide</p>
			<p>D : Download drawing as JSON</p>
		</li>
		<li class="slide-menu-item">
			<h3>Menu</h3>
			<p>M : Open menu</p>
			<p>H or LEFT : Next left panel</p>
			<p>L or RIGHT : Next right panel</p>
			<p>K or UP : Up</p>
			<p>J or DOWN : Down</p>
			<p>U or PAGE UP : Page up</p>
			<p>D or PAGE DOWN : Page down</p>
			<p>HOME : Top</p>
			<p>END : Bottom</p>
			<p>SPACE or RETURN : Selection</p>
			<p>ESC : Close menu</p>
		</li>
		<li class="slide-menu-item">
			<h3>Custom</h3>
			<p>I : ../index.html</p>
		</li></ul>` }
	],
  	themes: [// Specifies the themes that will be available in the themes menu panel. Set to 'true' to show the themes menu panel with the default themes list. 
		{ name: '########## light ##########', theme: 'themes/css/reveal-zenika-light.css' },
		{ name: 'white'},
		{ name: 'code-layers-multicolor', theme: 'themes/css/reveal-code-layers-multicolor.css' },
		{ name: 'containers', theme: 'themes/css/reveal-containers.css' },
		{ name: 'code-relax', theme: 'themes/css/reveal-code-relax.css' },
        { name: '########## dark ##########', theme: 'themes/css/reveal-zenika-dark.css' },
		{ name: 'security-dark', theme: 'themes/css/reveal-security-dark.css' },
		{ name: 'containers-dark', theme: 'themes/css/reveal-containers-dark.css' }]
},
navigationMode: "linear",
hash: true,
slideNumber: "c/t"
});
</script>
</body>
</html>
